In [1]:
from pandas import DataFrame, Series

In [2]:
marks = {
    'Name': ['mehul', 'jane', 'jill'],
    'Roll': [10, 13, 15],
    'Physics': [99, 95, 90],
    'Chemistry': [93, 99, 100]
}

In [3]:
d1 = DataFrame(marks)
print(d1)

    Name  Roll  Physics  Chemistry
0  mehul    10       99         93
1   jane    13       95         99
2   jill    15       90        100

In [4]:
d1

    Name  Roll  Physics  Chemistry
0  mehul    10       99         93
1   jane    13       95         99
2   jill    15       90        100

In [5]:
d2 = DataFrame(marks, index=marks['Roll'], columns=['Physics', 'Chemistry', 'Name'])
d2

    Physics  Chemistry   Name
10       99         93  mehul
13       95         99   jane
15       90        100   jill

In [6]:
print(d2.index)
print(d2.values)
print(d2.columns)

Int64Index([10, 13, 15], dtype='int64')
[[99 93 'mehul']
 [95 99 'jane']
 [90 100 'jill']]
Index(['Physics', 'Chemistry', 'Name'], dtype='object')

In [7]:
# indexing
# indexing by row (using the provided roll number index)
print(d2.loc[10])
print(d2.loc[[10, 15]])

# indexing by row (using the implicit 0 based index)
print(d2.iloc[0])
print(d2.iloc[[0, -1]])

# indexing by column
print(d2['Physics'])
print(d2[['Physics', 'Name']])

Physics         99
Chemistry       93
Name         mehul
Name: 10, dtype: object
    Physics  Chemistry   Name
10       99         93  mehul
15       90        100   jill
Physics         99
Chemistry       93
Name         mehul
Name: 10, dtype: object
    Physics  Chemistry   Name
10       99         93  mehul
15       90        100   jill
10    99
13    95
15    90
Name: Physics, dtype: int64
    Physics   Name
10       99  mehul
13       95   jane
15       90   jill

In [8]:
# row + column indexing
print(d2)
print(d2.iloc[[0, -1], [0, 1]])
print(d2.loc[[13, 15], ['Name', 'Physics']])

    Physics  Chemistry   Name
10       99         93  mehul
13       95         99   jane
15       90        100   jill
    Physics  Chemistry
10       99         93
15       90        100
    Name  Physics
13  jane       95
15  jill       90

In [9]:
# slicing
print(d2)
print(d2.iloc[-2:])
print(d2.iloc[:2])

# slicing along rows + columns
print(d2.iloc[:2, :2])

print(d2.iloc[:2, [0, -1]])

    Physics  Chemistry   Name
10       99         93  mehul
13       95         99   jane
15       90        100   jill
    Physics  Chemistry  Name
13       95         99  jane
15       90        100  jill
    Physics  Chemistry   Name
10       99         93  mehul
13       95         99   jane
    Physics  Chemistry
10       99         93
13       95         99
    Physics   Name
10       99  mehul
13       95   jane

In [10]:
print(d2)
maths_series = Series([100, 89, 94], index=[15, 10, 13])
print(maths_series)
d2['Maths'] = maths_series
print(d2)

    Physics  Chemistry   Name
10       99         93  mehul
13       95         99   jane
15       90        100   jill
15    100
10     89
13     94
dtype: int64
    Physics  Chemistry   Name  Maths
10       99         93  mehul     89
13       95         99   jane     94
15       90        100   jill    100

In [11]:
d2['Total'] = d2['Physics'] + d2['Chemistry'] + d2['Maths']
d2

    Physics  Chemistry   Name  Maths  Total
10       99         93  mehul     89    281
13       95         99   jane     94    288
15       90        100   jill    100    290

In [12]:
del d2['Total']
d2

    Physics  Chemistry   Name  Maths
10       99         93  mehul     89
13       95         99   jane     94
15       90        100   jill    100

In [13]:
d2

    Physics  Chemistry   Name  Maths
10       99         93  mehul     89
13       95         99   jane     94
15       90        100   jill    100

In [15]:
d3 = DataFrame({
    'Verbal': [99, 95, 80],
    'Quant': [100, 80, 78]
}, index=[13, 15, 10])
d3

    Verbal  Quant
13      99    100
15      95     80
10      80     78

In [17]:
d4 = d2.merge(d3, left_index=True, right_index=True)

In [18]:
d4

    Physics  Chemistry   Name  Maths  Verbal  Quant
10       99         93  mehul     89      80     78
13       95         99   jane     94      99    100
15       90        100   jill    100      95     80

In [19]:
d5 = d4[['Physics', 'Chemistry', 'Maths', 'Verbal', 'Quant']]

In [20]:
d5

    Physics  Chemistry  Maths  Verbal  Quant
10       99         93     89      80     78
13       95         99     94      99    100
15       90        100    100      95     80

In [21]:
d5.mean(axis=0)

Physics      94.666667
Chemistry    97.333333
Maths        94.333333
Verbal       91.333333
Quant        86.000000
dtype: float64

In [22]:
d5.sum(axis=1)

10    439
13    487
15    465
dtype: int64